Repository: ixdlabs/django-api-template
Catalog: locale/*/LC_MESSAGES/django.po
Languages: si

source: You don't have permissions to this achievement
si: මෙම මස්තකප්‍රාප්තියට ඔබට අවසර නොමැත

source: Unable to log in with provided credentials
si: ලබා දී ඇති අක්තපත්‍ර සමඟ පුරනය විය නොහැක

source: You are not a coach, so you cannot use this authentication method
si: ඔබ පුහුණුකරුවෙක් නොවන බැවින් මෙම සත්‍යාපන ක්‍රමය භාවිතා කළ නොහැක

source: Unable to log in with provided OTP
si: ලබා දී ඇති OTP සමඟ පුරනය විය නොහැක

source: You are not a customer, so you cannot use this authentication method
si: ඔබ පාරිභෝගිකයෙක් නොවන බැවින් මෙම සත්‍යාපන ක්‍රමය භාවිතා කළ නොහැක

source: This is the same phone number as your current phone number
si: මෙය ඔබගේ වර්තමාන දුරකථන අංකය මෙන්ම එකම අංකයයි

source: Unable to verify provided OTP
si: ලබා දී ඇති OTP සත්‍යාපනය කළ නොහැක

source: Used phone number is already in use, please use a different phone number
si: භාවිත කරන දුරකථන අංකය දැනටමත් භාවිතයේ පවතින බැවින් වෙනත් අංකයක් භාවිත කරන්න

source: You are not an employee, so you cannot use this authentication method
si: ඔබ සේවකයෙක් නොවන බැවින් මෙම සත්‍යාපන ක්‍රමය භාවිතා කළ නොහැක

source: OTP not created
si: OTP සෑදී නොමැත

source: OTP is expired
si: OTP කල් ඉකුත් වී ඇත

source: OTP is invalid
si: OTP වලංගු නොවේ

source: User does not belong to the branch of the access point.
si: පරිශීලකයාට මෙම ප්‍රවේශ ස්ථානයට අයත් ශාඛාවට අයත් නොවේ.

source: User must be a customer to have a record health metrics.
si: සෞඛ්‍ය අගයන් වාර්තා කිරීමට පරිශීලකයා ගනුදෙනුකරුවෙකු විය යුතුය.

source: There are no pending requests.
si: පොරොත්තු ඉල්ලීම් නොමැත.

source: You already have a pending request
si: ඔබට දැනටමත් පොරොත්තු ඉල්ලීමක් තිබේ.

source: Customer not found or you don't have permission to assign to this customer.
si: ගනුදෙනුකරු සොයාගත නොහැකිවීය හෝ මෙම ගනුදෙනුකරුට පවරන්නට ඔබට අවසර නැත.

source: Duplicate meal entry IDs are not allowed.
si: අනුපිටපත් ආහාර ඇතුළත් කිරීමේ හැඳුනුම්පත් වලට අවසර නැත.

source: Goal must belong to the same organization as the customer.
si: ඉලක්කය ගනුදෙනුකරුට අයත් ආයතනයට අයත් විය යුතුය.

source: Goal must belong to the same organization as the schedule.
si: ඉලක්කය කාලසටහනට අයත් ආයතනයට අයත් විය යුතුය.

source: A meal must be specified for a completion entry.
si: සම්පූර්ණ කිරීමේ ඇතුළත් කිරීමක් සඳහා ආහාර වේලක් නියම කළ යුතුය.

source: No current membership for the user.
si: පරිශීලකයා සදහා වත්මන් සාමාජිකත්වයක් නොමැත.

source: Membership is already bound to a device.
si: මෙම සාමාජිකත්වය දැනටමත් උපාංගයකට බැඳී ඇත.

source: Membership has no subscription.
si: මෙම සාමාජිකත්වයට ග්‍රාහකයක් නැත.

source: You don't have permission to assign this branch.
si: මෙම ශාඛාව පවරන සඳහා ඔබට අවසර නොමැත.

source: You don't have permission to assign to this customer.
si: මෙම ගනුදෙනුකරුට පවරන සඳහා ඔබට අවසර නොමැත.

source: You don't have permission to assign this package.
si: මෙම පැකේජය පවරන සඳහා ඔබට අවසර නොමැත.

source: Discount amount cannot be greater than package price.
si: වට්ටම් මුදල පැකේජයේ මිලට වඩා වැඩිවිය නොහැක.

source: Membership is not bound
si: සාමාජිකත්වය උපාංගයකට බැඳී නැත

source: Membership is inactive
si: සාමාජිකත්වය අක්‍රීයයි

source: Package duration in days must be divisible by 7.
si: පැකේජ කාලයේ දින ගණන 7න් බෙදිය හැකි විය යුතුයි.

source: User must be a customer to have a membership.
si: සාමාජිකත්වයක් ලබා ගැනීමට පරිශීලකයා ගනුදෙනුකරුවෙකු විය යුතුය.

source: Package must belong to the same branch as the customer.
si: පැකේජය ගනුදෙනුකරුට අයත් එම ශාඛාවට අයත් විය යුතුය.

source: Notification marked as read
si: දැනුම්දීම කියවූවක් ලෙස ලකුණු කර ඇත

source: All notifications marked as read
si: සියලු දැනුම්දීම් කියවූවක් ලෙස ලකුණු කර ඇත

source: All customers must belong to the same branch as the SMS group.
si: සියලුම ගනුදෙනුකරුවන් SMS කණ්ඩායම ඇති ශාඛාවටම අයත් විය යුතුය.

source: You don't have permission to access this SMS group.
si: ඔබට මෙම SMS කණ්ඩායමට අවසර නැත.

source: Only campaigns that are scheduled can be updated.
si: කාලසටහන්ගත කර ඇති ව්‍යාපාර පමණක් යාවත්කාලීන කළ හැකිය.

source: Only campaigns that are scheduled can be cancelled.
si: අවලංගු කළ හැක්කේ නියමිත ව්‍යාපාර පමණි.

source: Notification must belong to atleast one of the delivery methods (Push/SMS/EMail)
si: දැනුම්දීම අවම වශයෙන් එක් බෙදාහැරීමේ ක්‍රමයකට (Push/SMS/Email) අයත් විය යුතුය

source: Broadcasting is not supported with SMS services
si: SMS සේවාවන් සමඟ විකාශය ආධාර නොදක්වයි

source: SMS message body should be specified for SMS notifications
si: SMS දැනුම්දීම් සඳහා SMS පණිවිඩ අන්තර්ගතය නිශ්චිතව දැක්විය යුතුය.

source: Message body should be specified for email and push notifications
si: ඊමේල් සහ තල්ලු දැනුම්දීම් සඳහා පණිවිඩ අන්තර්ගතය නිශ්චිතව දැක්විය යුතුය.

source: Broadcasting is not supported with Email services
si: Email සේවාවන් සමඟ විකාශය ආධාර නොදක්වයි

source: Package must belong to the branch of the SMS group.
si: පැකේජය SMS කණ්ඩායමේ ශාඛාවට අයත් විය යුතුය.

source: Customer must belong to the same branch as the SMS group.
si: පාරිභෝගිකයා SMS කණ්ඩායම ඇති ශාඛාවටම අයත් විය යුතුය.

source: Scheduled time must be set if campaign is scheduled.
si: ප්‍රචාරක ව්‍යාපාරය සැලසුම් කර ඇත්නම්, නියමිත වේලාව නියම කළ යුතුය.

source: Package - %(package)s
si: පැකේජය - %(package)s

source: Workout Schedule Request
si: ව්‍යායාම කාලසටහන ඉල්ලීම

source: Workout Schedule - %(title)s
si: ව්‍යායාම කාලසටහන - %(title)s

source: Not Specified
si: නිශ්චිත කර නැත

source: There are more than one source specified.
si: එකට වැඩි මූලාශ්‍ර ගණනක් සඳහන් කර ඇත.

source: The gateway error must be a list
si: දෝෂය ලැයිස්තුවක් විය යුතුය

source: You are already enrolled to this branch
si: ඔබ දැනටමත් මෙම ශාඛාවට ලියාපදිංචි වී ඇත

source: Phone number must be set for a customer
si: ගනුදෙනුකරුවෙකුට දුරකථන අංකය සකසා තිබිය යුතුය

source: Organization must be set for an employee
si: සේවකයෙකුට ආයතනයක් සකසා තිබිය යුතුය

source: This phone number is already registered.
si: මෙම දුරකථන අංකය දැනටමත් ලියාපදිංචි වී ඇත.

source: User must be an employee to be added to a branch.
si: ශාඛාවකට එක් කිරීමට පරිශීලකයා සේවකයෙකු විය යුතුය.

source: The entry was marked as complete.
si: ඇතුළත් කිරීම සම්පූර්ණ ලෙස ලකුණු විය.

source: All entries were marked as complete.
si: සියලු ඇතුළත් කිරීම් සම්පූර්ණ ලෙස ලකුණු විය.

source: The entry was reset.
si: ඇතුළත් කිරීම නැවත පිහිටුවන ලදි.

source: Discount amount cannot be greater than schedule price.
si: වට්ටම් මුදල කාලසටහන් මිලට වඩා වැඩිවිය නොහැක.

source: You don't have permission to assign this workout category
si: මෙම ව්‍යායාම කාණ්ඩය පැවරීමට ඔබට අවසර නැත.

source: You don't have permission to assign this workout schedule
si: මෙම ව්‍යායාම කාලසටහන පැවරීමට ඔබට අවසර නොමැත

source: You don't have permission to assign this workout day
si: මෙම ව්‍යායාම දිනය පැවරීමට ඔබට අවසර නොමැත

source: You don't have permission to assign this workout
si: මෙම ව්‍යායාමය පැවරීමට ඔබට අවසර නොමැත

source: Workout schedule not found or don't have permission to assign.
si: ව්‍යායාම කාලසටහන සොයාගත නොහැකිවීය හෝ පැවරීමට අවසර නොමැත.

source: Target muscle must be set to strength based workouts.
si: මෙම ව්‍යායාමය සඳහා ඉලක්ක මාංසපේශිය සකස් කල යුතුය.

source: Number of reps is required for strength based workouts
si: ශක්තිමත් ව්‍යායාම සඳහා නැවත කිරීම් ගණන අවශ්‍යයි

source: Resting time is required for strength based workouts
si: ශක්තිමත් ව්‍යායාම සඳහා විවේක කාලය අවශ්‍යයි

source: Duration is required for time based workouts
si: කාලය පදනම් කරගත් ව්‍යායාම සඳහා කාලසීමාව අවශ්‍යයි

source: Workout schedule must belong to the same organization as the customer.
si: ව්‍යායාම කාලසටහන ගනුදෙනුකරුට අයත් එම ආයතනයට අයත් විය යුතුය.

source: Entry does not belong to the assigned workout schedule.
si: මෙම ඇතුළත් කිරීම පවරා ඇති ව්‍යායාම කාලසටහනට අයත් නොවේ.

source: Django site admin
si: Django අඩවි පරිපාලක

source: Django administration
si: Django පරිපාලනය
