Repository: ixdlabs/django-api-template
Catalog: apps/i18n/rest_framework_locale/locale/*/LC_MESSAGES/django.po
Languages: si

source: Invalid basic header. No credentials provided.
si: වලංගු නොවන මූලික ශීර්ෂය. අක්තපත්‍ර ලබා දී නොමැත.

source: Invalid basic header. Credentials string should not contain spaces.
si: වලංගු නොවන මූලික ශීර්ෂය. අක්තපත්‍රයේ අකුරු අතර හිස් ඉඩ නොවිය යුතුය.

source: Invalid basic header. Credentials not correctly base64 encoded.
si: වලංගු නොවන මූලික ශීර්ෂය. අක්තපත්‍ර Base64 ලෙස නිවැරදිව කේතගත කර නොමැත.

source: Invalid username/password.
si: වලංගු නොවන පරිශීලක නාමය/මුරපදය.

source: User inactive or deleted.
si: පරිශීලකය අක්‍රිය හෝ මකා ඇත.

source: Invalid token header. No credentials provided.
si: වලංගු නොවන ටෝකන් ශීර්ෂය. අක්තපත්‍ර ලබා දී නොමැත.

source: Invalid token header. Token string should not contain spaces.
si: වලංගු නොවන ටෝකන් ශීර්ෂය. ටෝකනයේ අකුරු අතර හිස් ඉඩ නොවිය යුතුය.

source: Invalid token header. Token string should not contain invalid characters.
si: වලංගු නොවන ටෝකන් ශීර්ෂය. ටෝකනයේ අවලංගු අකුරු නොවිය යුතුය.

source: Invalid token.
si: වලංගු නොවන ටෝකනයකි.

source: Auth Token
si: සත්‍යාපන ටෝකනය

source: Key
si: යතුර

source: User
si: පරිශීලක

source: Created
si: නිර්මාණය කළේ

source: Token
si: ටෝකනය

source: Tokens
si: ටෝකන

source: Username
si: පරිශීලක නාමය

source: Password
si: මුරපදය

source: Unable to log in with provided credentials.
si: ලබා දී ඇති අක්තපත්‍ර සමඟ පුරනය විය නොහැක.

source: Must include "username" and "password".
si: "පරිශීලක නාමය" සහ "මුරපදය" ඇතුළත් කළ යුතුය.

source: A server error occurred.
si: සේවාදායක දෝෂයක් සිදු විය.

source: Invalid input.
si: වලංගු නොවන ආදානයකි.

source: Malformed request.
si: වැරදිව සකස් කළ අයදුමකි.

source: Incorrect authentication credentials.
si: වැරදි සත්‍යාපන අක්තපත්‍රය.

source: Authentication credentials were not provided.
si: සත්‍යාපන අක්තපත්‍ර ලබා දී නොමැත.

source: You do not have permission to perform this action.
si: මෙම ක්‍රියාව සිදු කිරීමට ඔබට අවසර නොමැත.

source: Not found.
si: හමු නොවීය.

source: Method "{method}" not allowed.
si: "{method}" ක්‍රමය අවසර නොදේ.

source: Could not satisfy the request Accept header.
si: ඉල්ලීම් Accept ශීර්ෂය සපුරාලි නොහැකි විය.

source: Unsupported media type "{media_type}" in request.
si: ඉල්ලීම තුළ සහාය නොදක්වන මාධ්‍ය වර්ගය "{media_type}".

source: Request was throttled.
si: ඉල්ලීම සීමා කරන ලදි.

source: Expected available in {wait} second.
si: තව {wait} තත්පරයකින් ලබා ගත හැක.

source: Expected available in {wait} seconds.
si: තව {wait} තත්පරවලින් ලබා ගත හැක.

source: This field is required.
si: මෙම ක්ෂේත්‍රය අවශ්‍ය වේ.

source: This field may not be null.
si: මෙම ක්ෂේත්‍රය null විය නොහැක.

source: Must be a valid boolean.
si: වලංගු බූලියන් විය යුතුය.

source: Not a valid string.
si: වලංගු නොවන පෙළකි.

source: This field may not be blank.
si: මෙම ක්ෂේත්‍රය හිස්විය නොහැක.

source: Ensure this field has no more than {max_length} characters.
si: මෙම ක්ෂේත්‍රයේ අක්ෂර ගණන {max_length} ට වඩා නොමැති බව තහවුරු කරන්න.

source: Ensure this field has at least {min_length} characters.
si: මෙම ක්ෂේත්‍රයේ අවමයෙන් {min_length} අක්ෂර තිබිය යුතුය.

source: Enter a valid email address.
si: වලංගු ඊමේල් ලිපිනයක් ඇතුළත් කරන්න.

source: This value does not match the required pattern.
si: මෙම අගය අවශ්‍ය රටාවට ගැලපෙන්නේ නැත.

source: Enter a valid "slug" consisting of letters, numbers, underscores or hyphens.
si: අකුරු, ඉලක්කම්, යටිඉර හෝ සන්ධිඉර සහිත වලංගු "slug" එකක් ඇතුළත් කරන්න.

source: Enter a valid "slug" consisting of Unicode letters, numbers, underscores, or hyphens.
si: Unicode අකුරු, ඉලක්කම්, යටිඉර හෝ සන්ධිඉර සහිත වලංගු "slug" එකක් ඇතුළත් කරන්න.

source: Enter a valid URL.
si: වලංගු URL එකක් ඇතුළත් කරන්න.

source: Must be a valid UUID.
si: වලංගු UUID විය යුතුය.

source: Enter a valid IPv4 or IPv6 address.
si: වලංගු IPv4 හෝ IPv6 ලිපිනයක් ඇතුළත් කරන්න.

source: A valid integer is required.
si: වලංගු පූර්ණ සංඛ්‍යාවක් අවශ්‍ය වේ.

source: Ensure this value is less than or equal to {max_value}.
si: මෙම අගය {max_value} ට වඩා අඩු හෝ සමාන බව තහවුරු කරන්න.

source: Ensure this value is greater than or equal to {min_value}.
si: මෙම අගය {min_value} ට වඩා වැඩි හෝ සමාන බව තහවුරු කරන්න.

source: String value too large.
si: පෙළ අගය විශාල වැඩිය.

source: A valid number is required.
si: වලංගු සංඛ්‍යාවක් අවශ්‍ය වේ.

source: Ensure that there are no more than {max_digits} digits in total.
si: මුළු ගණන {max_digits} ට වඩා ඉලක්කම් නොමැති බව තහවුරු කරන්න.

source: Ensure that there are no more than {max_decimal_places} decimal places.
si: දශම ස්ථාන {max_decimal_places} ට වඩා නොමැති බව තහවුරු කරන්න.

source: Ensure that there are no more than {max_whole_digits} digits before the decimal point.
si: දශම ලකුණට පෙර ඉලක්කම් {max_whole_digits} ට වඩා නොමැති බව තහවුරු කරන්න.

source: Datetime has wrong format. Use one of these formats instead: {format}.
si: දිනය/වේලාව වැරදි ආකෘතියේ ඇත. මේ ආකෘති වලින් එකක් භාවිතා කරන්න: {format}.

source: Expected a datetime but got a date.
si: දිනය/වේලාවක් බලාපොරොත්තු වූ නමුත් දිනයක් ලැබුණි.

source: Invalid datetime for the timezone "{timezone}".
si: "{timezone}" කාල කලාපය සඳහා වැරදි දිනය/වේලාවකි.

source: Datetime value out of range.
si: දිනය/වේලාව අවසර ඇති සීමාවෙන් පිටව ඇත.

source: Date has wrong format. Use one of these formats instead: {format}.
si: දිනය වැරදි ආකෘතියේ ඇත. මේ ආකෘති වලින් එකක් භාවිතා කරන්න: {format}.

source: Expected a date but got a datetime.
si: දිනයක් බලාපොරොත්තු වූ නමුත් දිනය/වේලාවක් ලැබුණි.

source: Time has wrong format. Use one of these formats instead: {format}.
si: වේලාව වැරදි ආකෘතියේ ඇත. මේ ආකෘති වලින් එකක් භාවිතා කරන්න: {format}.

source: Duration has wrong format. Use one of these formats instead: {format}.
si: කාලය වැරදි ආකෘතියේ ඇත. මේ ආකෘති වලින් එකක් භාවිතා කරන්න: {format}.

source: "{input}" is not a valid choice.
si: "{input}" වලංගු තේරීමක් නොවේ.

source: More than {count} items...
si: අයිතම {count} ට වඩා...

source: Expected a list of items but got type "{input_type}".
si: අයිතම ලැයිස්තුවක් බලාපොරොත්තු වූ නමුත් "{input_type}" ලැබුණි.

source: This selection may not be empty.
si: මෙම තේරීම හිස් විය නොහැක.

source: "{input}" is not a valid path choice.
si: "{input}" වලංගු මාර්ග තේරීමක් නොවේ.

source: No file was submitted.
si: ගොනුවක් යොමු කර නොමැත.

source: The submitted data was not a file. Check the encoding type on the form.
si: යොමු කළ දත්ත ගොනුවක් නොවේ. පෝරමයේ කේතනය කිරීමේ වර්ගය පරීක්ෂා කරන්න.

source: No filename could be determined.
si: ගොනු නාමය තීරණය කළ නොහැකි විය.

source: The submitted file is empty.
si: යොමු කළ ගොනුව හිස් ය.

source: Ensure this filename has at most {max_length} characters (it has {length}).
si: මෙම ගොනු නාමයේ අක්ෂර {max_length} ට වඩා නොමැති බව තහවුරු කරන්න (දැන් {length} ඇත).

source: Upload a valid image. The file you uploaded was either not an image or a corrupted image.
si: වලංගු රූපයක් උඩුගත කරන්න. ඔබ උඩුගත කළ ගොනුව රූපයක් නොවීය හෝ විනාශ වී ඇත.

source: This list may not be empty.
si: මෙම ලැයිස්තුව හිස් විය නොහැක.

source: Ensure this field has at least {min_length} elements.
si: මෙම ක්ෂේත්‍රයේ අවමයෙන් {min_length} අංග තිබිය යුතුය.

source: Ensure this field has no more than {max_length} elements.
si: මෙම ක්ෂේත්‍රයේ අංග {max_length} ට වඩා නොමැති බව තහවුරු කරන්න.

source: Expected a dictionary of items but got type "{input_type}".
si: අයිතම ශබ්දකෝෂයක් බලාපොරොත්තු වූ නමුත් "{input_type}" ලැබුණි.

source: This dictionary may not be empty.
si: මෙම ශබ්දකෝෂය හිස් විය නොහැක.

source: Value must be valid JSON.
si: අගය වලංගු JSON විය යුතුය.

source: Search
si: සොයන්න

source: A search term.
si: සෙවීම සඳහා යොදන වචනය.

source: Ordering
si: අනුපිළිවෙල

source: Which field to use when ordering the results.
si: ප්‍රතිඵල අනුපිළිවෙලට ගන්වීමට භාවිතා කරන ක්ෂේත්‍රය.

source: ascending
si: ආරෝහණ

source: descending
si: අවරෝහණ

source: A page number within the paginated result set.
si: පිටු වශයෙන් වෙන්කළ ප්‍රතිඵල කට්ටලයේ පිටු අංකයක්.

source: Number of results to return per page.
si: පිටුවකට ලබා දිය යුතු ප්‍රතිඵල ගණන.

source: Invalid page.
si: වලංගු නොවන පිටුවකි.

source: The initial index from which to return the results.
si: ප්‍රතිඵල ලබා දිය යුතු ආරම්භක දර්ශකය.

source: The pagination cursor value.
si: පිටුකරණ කර්සර අගය.

source: Invalid cursor
si: වලංගු නොවන කර්සරය

source: Invalid pk "{pk_value}" - object does not exist.
si: වලංගු නොවන pk "{pk_value}" - වස්තුව නොපවතී.

source: Incorrect type. Expected pk value, received {data_type}.
si: වැරදි වර්ගය. pk අගයක් බලාපොරොත්තු වූ නමුත් {data_type} ලැබුණි.

source: Invalid hyperlink - No URL match.
si: වලංගු නොවන සබැඳිය - URL ගැලපීමක් නොමැත.

source: Invalid hyperlink - Incorrect URL match.
si: වලංගු නොවන සබැඳිය - වැරදි URL ගැලපීමකි.

source: Invalid hyperlink - Object does not exist.
si: වලංගු නොවන සබැඳිය - වස්තුව නොපවතී.

source: Incorrect type. Expected URL string, received {data_type}.
si: වැරදි වර්ගය. URL පෙළක් බලාපොරොත්තු වූ නමුත් {data_type} ලැබුණි.

source: Object with {slug_name}={value} does not exist.
si: {slug_name}={value} යන වස්තුව නොපවතී.

source: Invalid value.
si: වලංගු නොවන අගයකි.

source: unique integer value
si: අද්විතීය පූර්ණ සංඛ්‍යා අගය

source: UUID string
si: UUID පෙළ

source: unique value
si: අද්විතීය අගය

source: A {value_type} identifying this {name}.
si: මෙම {name} හඳුනාගන්නා {value_type}.

source: Invalid data. Expected a dictionary, but got {datatype}.
si: වලංගු නොවන දත්ත. ශබ්දකෝෂයක් බලාපොරොත්තු වූ නමුත් {datatype} ලැබුණි.

source: Extra Actions
si: අමතර ක්‍රියා

source: Filters
si: පෙරහන්

source: navbar
si: සංචාර තීරුව

source: content
si: අන්තර්ගතය

source: request form
si: ඉල්ලීම් පෝරමය

source: main content
si: ප්‍රධාන අන්තර්ගතය

source: request info
si: ඉල්ලීම් තොරතුරු

source: response info
si: ප්‍රතිචාර තොරතුරු

source: None
si: කිසිවක් නැත

source: No items to select.
si: තේරිය හැකි අයිතම නොමැත.

source: This field must be unique.
si: මෙම ක්ෂේත්‍රය අද්විතීය විය යුතුය.

source: The fields {field_names} must make a unique set.
si: {field_names} ක්ෂේත්‍රය අද්විතීය සමුදායක් බව තහවුරු කළ යුතුය.

source: Surrogate characters are not allowed: U+{code_point:X}.
si: ප්‍රතිස්ථාපන අක්ෂර අවසර නැත: U+{code_point:X}.

source: This field must be unique for the "{date_field}" date.
si: "{date_field}" දිනය සඳහා මෙම ක්ෂේත්‍රය අද්විතීය විය යුතුය.

source: This field must be unique for the "{date_field}" month.
si: "{date_field}" මාසය සඳහා මෙම ක්ෂේත්‍රය අද්විතීය විය යුතුය.

source: This field must be unique for the "{date_field}" year.
si: "{date_field}" වර්ෂය සඳහා මෙම ක්ෂේත්‍රය අද්විතීය විය යුතුය.

source: Invalid version in "Accept" header.
si: "Accept" ශීර්ෂයේ වලංගු නොවන අනුවාදය.

source: Invalid version in URL path.
si: URL මාර්ගයේ වලංගු නොවන අනුවාදය.

source: Invalid version in URL path. Does not match any version namespace.
si: URL මාර්ගයේ වලංගු නොවන අනුවාදය. කිසිඳු අනුවාද නාම අවකාශයට ගැලපෙන්නේ නැත.

source: Invalid version in hostname.
si: ඇගයුම් නාමය තුළ වලංගු නොවන අනුවාදය.

source: Invalid version in query parameter.
si: විමසුම් පරාමිතිය තුළ වලංගු නොවන අනුවාදය.
